
import Vue from 'vue'             //引入vue 模块
import Router from 'vue-router' //引入vue-router 模块
// 使用路由
Vue.use(Router)
// ---------------------------------------------------------------------------------------------

// 路由拆分，导入其他的路由模块 

// 拆分路由的时候，最好是 拆分出来的路由模块跟  router下的默认 index.js同级是最好的，

// 理由是 方便 导入组件  import elmHome from '@/views/element/elmHome'  这种形式导入组件

// import main from './home' 

// ---------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------

//  导入 element 相关组件
// import elmHome from '@/views/element/elmHome'

// 懒加载路由
// 当路由被访问的时候才加载对应组件
// const elmHome = resolve => require(['@v/element/elmHome'], resolve)
// ---------------------------------------------------------------------------------------------

// 构建路由表信息

const routes = [
]

// ---------------------------------------------------------------------------------------------

// 导出路由
export default new Router({
    // mode: 'history',
    linkActiveClass: 'active',
    routes
})

// ---------------------------------------------------------------------------------------------
